---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionSymbol
source: html/5e736607-46ef-3db8-16ad-25ec4a8686a6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionSymbol Property

"Connection Symbol"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionSymbol { get; }
```